InformationRegisters/ЗапросНаИзменениеРеквизитов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЗапросНаИзменениеРеквизитов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗначениеХарактеристик</v8:Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидПричины</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПричинПереносаСроков</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Адресат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
						<v8:Type>cfg:CatalogRef.Задачи</v8:Type>
						<v8:Type>cfg:CatalogRef.СтратегическиеЦели</v8:Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НазваниеРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗапросНаИзменениеРеквизитов/Ext/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	Для Каждого Запись Из ЭтотОбъект Цикл
		//создаем задачу адресату
		НоваяЗадача = Задачи.ЗадачаИсполнителя.СоздатьЗадачу();
		//НоваяЗадача.БизнесПроцесс = ЭтотОбъект.Ссылка;
		//НоваяЗадача.ТочкаМаршрута = БизнесПроцессы.Согласование.ТочкиМаршрута.ОпределитьСписокРецензентов;
		НоваяЗадача.Дата = ТекущаяДатаСеанса();
		НоваяЗадача.Наименование = "Изменение даты окончания задачи";
		НоваяЗадача.Автор = Запись.Пользователь;
		НоваяЗадача.АвторСтрокой = Строка(Запись.Пользователь);
		НоваяЗадача.Исполнитель = Запись.Адресат;
		НоваяЗадача.Важность = Перечисления.ВариантыВажностиЗадачи.Высокая;
		НоваяЗадача.Предмет = Запись.Объект;
		НоваяЗадача.ПредметСтрокой = Строка(Запись.Объект);
		
		ТекстОписание = СтрШаблон("Задача: %1
								|Пользователь %2 отправил запрос на изменение даты окончания задачи на %3
								|по причине: %4.",
								НоваяЗадача.ПредметСтрокой,
								Строка(Запись.Пользователь),
								Формат(Запись.Значение, "ДФ=dd.MM.yyyy"),
								Запись.Причина);
		НоваяЗадача.Описание = ТекстОписание;
		НоваяЗадача.НаименованиеРеквизита = Запись.НазваниеРеквизита;
		НоваяЗадача.ДатаНачала = Запись.Период;
		НоваяЗадача.ВидЗадачи = Перечисления.видыЗадач.Согласование;
		НоваяЗадача.Записать();

	КонецЦикла;
КонецПроцедуры
